In [1]:
import pandas as pd

In [2]:
data = { 'a':[1,2,3,4], 'b':[4,5,6,7], 'c':["nitesh","naya","khiladi","khel"]}

In [3]:
data

{'a': [1, 2, 3, 4],
 'b': [4, 5, 6, 7],
 'c': ['nitesh', 'naya', 'khiladi', 'khel']}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b        c
0  1  4   nitesh
1  2  5     naya
2  3  6  khiladi
3  4  7     khel

In [9]:
df.set_index('c',inplace = True)

In [10]:
df

         a  b
c
nitesh   1  4
naya     2  5
khiladi  3  6
khel     4  7

In [11]:
df.reset_index()

         c  a  b
0   nitesh  1  4
1     naya  2  5
2  khiladi  3  6
3     khel  4  7

         a  b
c
nitesh   1  4
naya     2  5
khiladi  3  6
khel     4  7

In [17]:
data = { 'a':[1,2,3,4], 'b':[4,5,6,7], 'c':["nitesh","naya","khiladi","khel"]}
df1 = pd.DataFrame(data,index = ('a','b','c','d'))

In [18]:
df1

   a  b        c
a  1  4   nitesh
b  2  5     naya
c  3  6  khiladi
d  4  7     khel

In [25]:
df1.iteritems()

AttributeError: 'DataFrame' object has no attribute 'iteritems'

In [26]:
for i in df1.items():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a     nitesh
b       naya
c    khiladi
d       khel
Name: c, dtype: object)

In [27]:
def test(x):
    return x.sum()
df1.apply(test,axis = 0)

a                       10
b                       22
c    niteshnayakhiladikhel
dtype: object

In [28]:
df2 = df1[['a','b']]

In [29]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [31]:
df2.map(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [39]:
df1.sort_index()

   a  b        c
a  1  4   nitesh
b  2  5     naya
c  3  6  khiladi
d  4  7     khel